"==============================Tuple======================================="
# кортеж - неизменяемый, индексируемый, упорядоченный, итерируемый тип данных, предназначенный для хранения любых данных в определенном порядке (в целом, не отличается от списков, просто не изменяемый, поэтому он занимает меньше памяти)

# литералы кортежа = запятые, а не скобки

tuple1 = (1, 2, 3)
print(type(tuple1)) # <class 'tuple'>
tuple2 = (2)
print(type(tuple2)) # <class 'int'>
tuple3 = (2,) # tuple
tuple4 = 4, # tuple
tuple5 = (1, 'hello', [2,3,4])
tuple5[-1].append(5)
print(tuple5)

#1 способ создания tuple
tuple_ = (1,2,3)
tuple_ = 1,

# 2 способ
tuple6 = tuple('hello')
print(tuple6) #('h', 'e', 'l', 'l', 'o')


"==========================================Методы tuple=========================="
print(dir(tuple6))

# .count() - метод, который считает количество принятого элемента в кортеже
tuple_ = (1, 2, 1, 1, 1, 1, 2, 3, 4, 5, 6, 7, 1, 2)
print(tuple_.count(1)) # 6

final_list = []

def list_ind(l1, l2):
    try:
        for i in l1:
            final_list.append(l2[i])
        print(final_list)
    except IndexError:
        print('длина списка l1 больше чем количество элементов в списке l2')
l1 = [2, 3, 0, 1]

l2 = [10, 20, 30, 40]

list_ind(l1, l2)
